Revit 2027 API
BuiltInFailures.GroupFailures.GroupViewSpecificDiffViews Property
 You may not create a detail group with view specific elements from different views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupViewSpecificDiffViews { get; }
Public Shared ReadOnly Property GroupViewSpecificDiffViews As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupViewSpecificDiffViews {
	FailureDefinitionId^ get ();
}
static member GroupViewSpecificDiffViews : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace